In [2]:
#libraries
import pandas as pd
import random

#import data
df = pd.read_csv(r'C:\Users\colin\Desktop\data\Excel\Elo_rating_system\Player_tbl.csv', sep=';')
df

         Name  Level
0       Abdul      2
1       Ahmed      4
2   Alexandre      6
3         Ali      8
4       Anita     10
5        Anna     12
6     Antonio     14
7     Barbara     16
8      Carlos     18
9     Charles     20
10     Daniel     22
11      David     24
12      Elena     26
13  Elizabeth     28
14     Fatima     30
15    Francis     32
16     George     34
17    Ibrahim     40
18      James     42
19       Jean     44
20       John     46
21       Jose     48
22     Joseph     50
23       Juan     62
24      Laura     64
25        Lei     66
26       Lola     68
27      Louis     80
28      Marie     84
29      Mario     88
30     Martha    122
31    Michael    146
32        Min    184
33   Mohammed    230
34     Nushi     248
35       Olga    266
36       Paul    284
37      Pedro    302
38      Peter    370
39    Richard    434
40       Rita    502
41     Robert    586
42       Rose    756
43      Sarah    828
44     Thomas    844
45     Victor    890
46        Wei    924
47    William    956
48        Yan    976
49        Zoe   1000

Commencons par l’idée la plus simple, chaque victoire donne 1 point au vainqueur

In [9]:
round = range(1, 1001)
df_score = df.pivot_table(index='Name', fill_value=0)

player1_Name = df[df['Name'] == 'Martha']
player1_Lvl = int(player1_Name.iloc[0]['Level'])
player2_Name = df[df['Name'] == 'Paul']
player2_Lvl = int(player2_Name.iloc[0]['Level'])

win_con = player1_Lvl / (player1_Lvl + player2_Lvl)

for i in round:
    round_win = random.random()
    if round_win <= win_con:
        pass
        #score += 1

df_score

            Level
Name
Abdul         2.0
Ahmed         4.0
Alexandre     6.0
Ali           8.0
Anita        10.0
Anna         12.0
Antonio      14.0
Barbara      16.0
Carlos       18.0
Charles      20.0
Daniel       22.0
David        24.0
Elena        26.0
Elizabeth    28.0
Fatima       30.0
Francis      32.0
George       34.0
Ibrahim      40.0
James        42.0
Jean         44.0
John         46.0
Jose         48.0
Joseph       50.0
Juan         62.0
Laura        64.0
Lei          66.0
Lola         68.0
Louis        80.0
Marie        84.0
Mario        88.0
Martha      122.0
Michael     146.0
Min         184.0
Mohammed    230.0
Nushi       248.0
Olga        266.0
Paul        284.0
Pedro       302.0
Peter       370.0
Richard     434.0
Rita        502.0
Robert      586.0
Rose        756.0
Sarah       828.0
Thomas      844.0
Victor      890.0
Wei         924.0
William     956.0
Yan         976.0
Zoe        1000.0